app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", nil], ["body", "trial 1"], ["post_id", 4], ["created_at", "2023-12-18 05:48:01.742954"], ["updated_at", "2023-12-18 05:48:01.742954"]]
---
    def create
      @comment = @post.comments.new(comment_params)

      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
    def destroy
        @comment = @post.comments.find(params[:id])