app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "12"], ["content", "123"], ["created_at", "2023-12-16 09:35:44.931329"], ["updated_at", "2023-12-16 09:35:44.931329"]]
---
    def create
      @post = Post.new(post_params)

      if @post.save